of40/tutorials/rheoFoam/CrossSlot/PTTLog/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{
                
                type             PTTlinearLog;

                rho              rho [1 -3 0 0 0 0 0] 1;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.1111111;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.8888889;                 
                lambda           lambda [0 0 1 0 0 0 0] 0.6; 
                epsilon          epsilon [0 0 0 0 0 0 0] 0.02;  
                zeta             zeta [0 0 0 0 0 0 0] 0.; // Simplified PTT -> zeta = 0 

                stabilization    coupling;                     
}

passiveScalarProperties
{
                solvePassiveScalar   on;
                D                    D [ 0 2 -1 0 0 0 0 ] 0.002; 
}

// ************************************************************************* //
